[
  {"id":"adzobu__2014__testing","abstract":"This paper investigates how strategy formulation and implementation processes used by the University of Cape Coast (UCC) in building its digital collections compare with the Andrew’s strategic formulation and implementation theoretical framework. Theory-testing case study methodology was used. The data collection instruments were the key informant interview technique and document reviews. During the formulation phase, two aspects (resources and aspirations of senior management) were emergent. During the implementation phase, five aspects (achieving results, processes and behaviour, standards, motivation, personal) were emergent. All other elements of building the UCC digital collections were planned during both the formulation and implementation phases. Although the emphasis on students and learning is laudable and apt, there seems to be lack of focus on research support beyond digital collection building, despite the fact that research excellence is one of the UCC’s key priorities. Opportunities exist for improving feedback mechanisms between the users, digital library staff and the university management; and inclusion of social media tools in the digital library project. Since only the experience of a single institution of higher learning is considered, it cannot be definitively stated that strategy formulation and implementation will be similar in every institutional context. However, the results provide a basis for academic digital libraries to draw lessons from this case. In African public universities, there is little earlier research on strategy formulation and implementation in digital library management. Strategy formulation and implementation is a critical issue for higher education academic libraries especially in developing countries like Ghana, due to limited financial resources and the rapid change in the information environment during the last several decades.","accessed":{"date-parts":[[2020,1,17]]},"author":[{"family":"Adzobu","given":"Nesba Yaa Anima"}],"citation-key":"adzobu__2014__testing","container-title":"International Journal of Knowledge Content Development & Technology","DOI":"10.5865/IJKCT.2014.4.2.049","issue":"2","issued":{"date-parts":[[2014,12,31]]},"keyword":"__strategy2030:strategic-planning;__strategy2030:strategic-planning:swot;collection::strategy::planning","language":"english","note":"http://web.archive.org/web/20200117095141/http://koreascience.or.kr/article/JAKO201405458147004.page","page":"49-65","source":"DOI.org (CSL JSON)","title":"Testing the Andrews Framework of Strategy Formulation and Implementation: Case Study of the University of Cape Coast Digital Library in Ghana","title-short":"Testing the Andrews Framework of Strategy Formulation and Implementation","type":"article-journal","URL":"10.5865/IJKCT.2014.4.2.049","volume":"4"},
  {"id":"alexander_ishikawa_etal__1977__pattern","author":[{"family":"Alexander","given":"Christopher"},{"family":"Ishikawa","given":"Sara"},{"family":"Silverstein","given":"Murray"}],"call-number":"NA2500 .A445","citation-key":"alexander_ishikawa_etal__1977__pattern","event-place":"New York","ISBN":"978-0-19-501919-3","issued":{"date-parts":[[1977]]},"keyword":"#nosource;Semiotics;Symbolism in architecture;collection::strategy::software-engineering","number-of-pages":"1171","publisher":"Oxford University Press","publisher-place":"New York","source":"Library of Congress ISBN","title":"A pattern language: towns, buildings, construction","title-short":"A pattern language","type":"book"},
  {"id":"allison_kaye__2015__strategic","abstract":"This edition offers a conceptual framework and detailed process suggestions for strategic planning by nonprofit organizations.","author":[{"family":"Allison","given":"Michael"},{"family":"Kaye","given":"Jude"}],"citation-key":"allison_kaye__2015__strategic","collection-title":"John Wiley & Sons","ISBN":"1-118-76814-0","issued":{"date-parts":[[2015,4,6]]},"keyword":"#nosource;__strategy2030:strategic-planning;__strategy2030:strategic-planning:nonprofit-organizations;collection::strategy::non-profit","language":"en-US","publisher":"John Wiley & Sons","title":"Strategic Planning for Nonprofit Organizations","type":"book"},
  {"id":"bachani__2012__strategy","abstract":"Nonprofit Organizations need strategies to be effective, but the available tools for making strategy were developed primarily for business organizations. This book provides a model and several case studies for Strategy Making in Nonprofit Organizations. The strategy making model modifies the business practices of Strategy-Structure-Systems for the nonprofit context with a focus on Purpose-Processes-People that is more suitable to meet their unique challenges. In this book, the leaders of nonprofit organizations will find ways to better articulate the challenges that their organizations face for communicating with their business partners, donors and employees. As the demand for essential social services is growing and the budgets are declining, leaders and managers in both Nonprofit and Business organizations need the solutions offered in this book. Nonprofit Organizations face an external environment where demand outstrips their ability to meet it. They face competition in raising funds and resources to provide these services. They rely on processes to harness the creativity of their people in delivering to the triple bottom line of economic, social and environmental impact. This book provides a bridge between business and nonprofit organizations.","author":[{"family":"Bachani","given":"Jyoti"}],"citation-key":"bachani__2012__strategy","issued":{"date-parts":[[2012,12,10]]},"keyword":"#nosource;__strategy2030:strategic-planning;__strategy2030:strategic-planning:nonprofit-organizations;collection::strategy::non-profit","language":"en-US","title":"Strategy Making in Nonprofit Organizations","type":"book"},
  {"id":"baralou_wolf_etal__2012__erhellend","abstract":"Erhellend, exzellent, ignoriert – Luhmann’s Beitrag zur Systemtheorie und seine Nicht-Anschlussfähigkeit zur akademischen Managementforschung«. Niklas Luhmann’s theory has been largely ignored in organization studies, compared to other sociological approaches like Weick's sensemaking, Giddens’ structuration theory, or Latour’s Actor-Network Theory. While having being applied on a number of fields, such as philosophy, sociology, theology, law and political sciences, application of Luhmann’s theory is still limited in organization studies (e.g. Munro 2010). In this paper, we attempt to explain the reasons of this ignorance and limited use, focusing on Luhmann’s writing style, but also on the theoretical and empirical limitations his theory poses. Believing that Luhmann’s theory holds great potential to be applied to organizational studies and explain organizational phenomena, we then discuss how it could contribute to radically changing the conventional ways of studying and analyzing organizational phenomena, fostering at the same time, the debate about the value of his theory. We analyze organizations as communicative processes that continuously produce and reproduce themselves to create knowledge, make decisions, structure expectations, and redefine organizational boundaries. Finally, we address the empirical challenges of applying Luhmann’s theory on organization studies.","accessed":{"date-parts":[[2023,3,14]]},"author":[{"family":"Baralou","given":"Evangelia"},{"family":"Wolf","given":"Patricia"},{"family":"Meissner","given":"Jens O. O."}],"citation-key":"baralou_wolf_etal__2012__erhellend","container-title":"<p>Historical Social Research Vol. 37","contributor":[{"family":"GESIS-Leibniz-Institut Für Sozialwissenschaften","given":""}],"DOI":"10.12759/HSR.37.2012.4.289-308","ISSN":"0172-6404","issued":{"date-parts":[[2012]]},"keyword":"Schreiben;Anwendung;application;communication medium;decision aid;Entscheidungshilfe;Erwartung;expectation;Geschäftsführung;Giddens, A.;knowledge;Kommunikationsmittel;Luhmann, N.;management;Organisationsforschung;organization research;structure;Struktur;system theory;Systemtheorie;Wissen;writing","language":"en","page":"Volumes per year: 1</p>","publisher":"HSR (GESIS Leibniz Institute for the Social Sciences)","source":"DOI.org (Datacite)","title":"Erhellend, exzellent, ignoriert: Luhmann's Beitrag zur Systemtheorie und seine Nicht-Anschlussfähigkeit an die akademischen ManagementforschungBright, Excellent, Ignored: The Contribution of Luhmann's System Theory and Its Problem of Non-Connectivity to Academic Management Research","title-short":"Erhellend, exzellent, ignoriert","type":"article-journal","URL":"http://www.ssoar.info/ssoar/handle/document/38384","version":"1","volume":"No. 4"},
  {"id":"barbrook-johnson_penn__2022__systems","accessed":{"date-parts":[[2022,11,16]]},"author":[{"family":"Barbrook-Johnson","given":"Pete"},{"family":"Penn","given":"Alexandra S."}],"citation-key":"barbrook-johnson_penn__2022__systems","DOI":"10.1007/978-3-031-01919-7","event-place":"Cham","ISBN":"978-3-031-01833-6 978-3-031-01919-7","issued":{"date-parts":[[2022]]},"keyword":"/unread;collection::strategy::planning","language":"en","publisher":"Springer International Publishing","publisher-place":"Cham","source":"DOI.org (Crossref)","title":"Systems Mapping: How to build and use causal models of systems","title-short":"Systems Mapping","type":"book","URL":"https://link.springer.com/10.1007/978-3-031-01919-7"},
  {"id":"bell_huang__1997__dynamic","abstract":"In this paper we introduce and formalise dynamic goal hierarchies. We begin with a formal deﬁnition of goals, according to which they are rational desires. In particular, we require that an agent’s goals are coherent; that is, that the agent believes that each goal is jointly realisable with all of the goals which the agent considers to be more important. Thus an agent’s goals form a hierarchy, and new goals are deﬁned with reference to it. We then show how preferential entailment can be used to formalise the rational revision of goals and goal hierarchies.","accessed":{"date-parts":[[2023,3,14]]},"author":[{"family":"Bell","given":"John"},{"family":"Huang","given":"Zhisheng"}],"citation-key":"bell_huang__1997__dynamic","collection-editor":[{"family":"Carbonell","given":"Jaime. G."},{"family":"Siekmann","given":"Jörg"},{"family":"Goos","given":"G."},{"family":"Hartmanis","given":"J."},{"family":"Leeuwen","given":"J."}],"container-title":"Intelligent Agent Systems Theoretical and Practical Issues","DOI":"10.1007/3-540-62686-7_30","editor":[{"family":"Cavedon","given":"Lawrence"},{"family":"Rao","given":"Anand"},{"family":"Wobcke","given":"Wayne"}],"event-place":"Berlin, Heidelberg","ISBN":"978-3-540-62686-2 978-3-540-68433-6","issued":{"date-parts":[[1997]]},"keyword":"","language":"en","page":"88-103","publisher":"Springer Berlin Heidelberg","publisher-place":"Berlin, Heidelberg","source":"DOI.org (Crossref)","title":"Dynamic goal hierarchies","type":"chapter","URL":"http://link.springer.com/10.1007/3-540-62686-7_30","volume":"1209"},
  {"id":"blackwell_phaal_etal__2008__strategy","author":[{"family":"Blackwell","given":"Alan"},{"family":"Phaal","given":"Robert"},{"family":"Eppler","given":"Martin"},{"family":"Crilly","given":"Nathan"}],"citation-key":"blackwell_phaal_etal__2008__strategy","DOI":"10.1007/978-3-540-87730-1_14","issued":{"date-parts":[[2008,9]]},"keyword":"__strategy2030:strategic-planning:roadmapping;collection::strategy::roadmapping","page":"127-140","title":"Strategy Roadmaps: New Forms, New Practices","type":"paper-conference","URL":"10.1007/978-3-540-87730-1_14","volume":"5223"},
  {"id":"bryson__2018__strategic","abstract":"Revised edition of the author's Strategic planning for public and nonprofit organizations, c2001.","author":[{"family":"Bryson","given":"John M"}],"citation-key":"bryson__2018__strategic","collection-title":"John Wiley & Sons","ISBN":"1-119-07160-7","issued":{"date-parts":[[2018,1,4]]},"keyword":"#nosource;__strategy2030:strategic-planning;__strategy2030:strategic-planning:nonprofit-organizations;collection::strategy::non-profit","language":"en-US","publisher":"John Wiley & Sons","title":"Strategic Planning for Public and Nonprofit Organizations","type":"book"},
  {"id":"bryson_ackermann_etal__2014__visual","abstract":"Strategic planning becomes visual with strategy maps and the tools, techniques, and guidance for turning them into effective action. Developed as a companion workbook to John Bryson's best-selling Strategic Planning in Public and Nonprofit Organizations, Visual Strategy: A Workbook for Strategy Mapping in Public and Nonprofit Organizations, goes beyond making the case for good and effective strategic planning to making strategy visual through effective strategy mapping. Strategy mapping prevents groups of people from talking over one another and going around in circles. It helps people speak and be heard, produce lots of ideas and understand how they fit together, make use of causal reasoning, and clarify ultimately what they want to do in terms of mission, goals, strategies, and actions. Strategy mapping can join process and content in such a way that good ideas worth implementing are found and the agreements and comments needed to implement them are reached. The result is living strategic plans that act as useful guides to action. With detailed examples, actual strategy maps, process guidelines and hand-drawn illustrations, the book will help leaders, managers, students and other professionals see patterns across mission, goals, strategies and actions while helping to identify areas of alignment and misalignment and determine, real time, where elements are needed, missing or not useful in a strategic plan. For leaders and managers of public and nonprofit organizations, facilitators and consultants, professors and students of strategic planning, strategic management, strategic mapping, and public policy, professional development workshops focused on strategic planning and strategy mapping.","author":[{"family":"Bryson","given":"John M"},{"family":"Ackermann","given":"Fran"},{"family":"Eden","given":"Colin"}],"citation-key":"bryson_ackermann_etal__2014__visual","collection-title":"John Wiley & Sons","ISBN":"1-118-60592-6","issued":{"date-parts":[[2014,7,28]]},"keyword":"#nosource;__strategy2030:strategic-planning;collection::strategy::roadmapping","language":"en-US","publisher":"John Wiley & Sons","title":"Visual Strategy: Strategy Mapping for Public and Nonprofit Organizations","title-short":"Visual Strategy","type":"book","URL":"https://learning.oreilly.com/library/view/visual-strategy-strategy/9781118876695/"},
  {"id":"bryson_alston__2011__creating","abstract":"Creating Your Strategic Plan is the best-selling companion workbook to Bryson's landmark book, Strategic Planning for Public and Nonprofit Organizations. Whether used with the main text or by itself, this thoroughly revised third edition provides a step-by-step guide to putting strategic planning to work in public and nonprofit organizations. The workbook contains new and revised worksheets and additional material on readiness assessment, teamwork, stakeholder analysis, visioning, strategic issue identification, and implementation. Creating Your Strategic Plan covers each of the ten key steps of the strategic planning process and each step description includes sections on purpose and possible desired planning outcomes. The authors provide clear instructions for creating a strategic plan tailored to the needs of the individual organization. The workbook features practical advice to help readers: Refine mission and values Assess the internal and external environment Identify and frame strategic issues Formulate strategies to manage the issues Create, review, and adopt the strategic plan Assess the process From setting up the meeting room, to establishing a vision of—and plan for—the future, this indispensable workbook will take readers through every step of the strategic planning process.","author":[{"family":"Bryson","given":"John M"},{"family":"Alston","given":"Farnum K"}],"citation-key":"bryson_alston__2011__creating","collection-title":"John Wiley & Sons","ISBN":"0-470-40535-X","issued":{"date-parts":[[2011,8,9]]},"keyword":"#nosource;__strategy2030:strategic-planning;collection::strategy::planning","language":"en-US","publisher":"John Wiley & Sons","title":"Creating Your Strategic Plan","type":"book"},
  {"id":"caine____need","abstract":"The importance of strategy and strategy construct is not a new phenomenon. However as strategy work becomes less tangible, concerns with understanding, describing, and managing strategies develops into an increasingly complex subject. Current strategy concepts are dispersed and lack integration. Moreover, the enablement of modelling practices around strategy concepts considering the entire strategy lifecycle are also missing. Consequently, this paper focuses on issues with strategy in theory and practice, why a strategy ontology is needed and how this can be developed.","author":[{"family":"Caine","given":"Jamie"}],"citation-key":"caine____need","keyword":"collection::strategy::ontology","language":"en","page":"8","source":"Zotero","title":"The Need and Requirements to a Strategy Ontology","type":"article-journal"},
  {"id":"caine_vonrosing__2018__introducing","abstract":"The ability of existing strategy concepts to analyse strategy, design strategy and execute strategy within organisations has an alarmingly poor historical track record. Based on the long-standing semiotics and ontology research work of the Global University Alliance (GUA) and its members, a Strategy Lifecycle is introduced. The StrategyLifecycle, underpinned by ontology and semiotics incorporates all the constructs that can be found in the most popular strategy concepts and frameworks. It explains the value of the underlying strategy ontology and the relationship between the strategy meta model, the Strategy Lifecycle and various artefacts used around strategy work. The paper concludes with futurescope and application that lies ahead for the Strategy Lifecycle.","accessed":{"date-parts":[[2021,7,13]]},"author":[{"family":"Caine","given":"Jamie"},{"family":"Rosing","given":"Mark","non-dropping-particle":"von"}],"citation-key":"caine_vonrosing__2018__introducing","container-title":"Digitalisation, Innovation, and Transformation","DOI":"10.1007/978-3-319-94541-5_14","editor":[{"family":"Liu","given":"Kecheng"},{"family":"Nakata","given":"Keiichi"},{"family":"Li","given":"Weizi"},{"family":"Baranauskas","given":"Cecilia"}],"event-place":"Cham","ISBN":"978-3-319-94540-8 978-3-319-94541-5","issued":{"date-parts":[[2018]]},"keyword":"collection::strategy::ontology","language":"en","page":"136-144","publisher":"Springer International Publishing","publisher-place":"Cham","source":"DOI.org (Crossref)","title":"Introducing the Strategy Lifecycle: Using Ontology and Semiotics to Interlink Strategy Design to Strategy Execution","title-short":"Introducing the Strategy Lifecycle","type":"chapter","URL":"http://link.springer.com/10.1007/978-3-319-94541-5_14","volume":"527"},
  {"id":"clausewitz__1832__vom","author":[{"family":"Clausewitz","given":"Carl","dropping-particle":"von"}],"citation-key":"clausewitz__1832__vom","collection-title":"Null Papier","edition":"Epub Ausgabe. Erstausgabe 1832","ISBN":"978-3-95418-174-2","issued":{"date-parts":[[1832]]},"keyword":"#nosource;__strategy2030:strategic-planning;collection::strategy::military","language":"de-DE","publisher":"Null Papier","title":"Vom Kriege","type":"book","URL":"http://www.worldcat.org/title/vom-kriege-vollstandige-ausgabe/oclc/904844186"},
  {"id":"cropanzano_citera_etal__1995__goal","accessed":{"date-parts":[[2023,3,14]]},"author":[{"family":"Cropanzano","given":"Russell"},{"family":"Citera","given":"Maryalice"},{"family":"Howes","given":"John"}],"citation-key":"cropanzano_citera_etal__1995__goal","container-title":"Motivation and Emotion","container-title-short":"Motiv Emot","DOI":"10.1007/BF02250564","ISSN":"0146-7239, 1573-6644","issue":"2","issued":{"date-parts":[[1995,6]]},"keyword":"","language":"en","note":"14 citations (Crossref) [2023-03-14]","page":"77-98","source":"DOI.org (Crossref)","title":"Goal hierarchies and plan revision","type":"article-journal","URL":"http://link.springer.com/10.1007/BF02250564","volume":"19"},
  {"id":"dimand_dimand__1994__neumann","author":[{"family":"Dimand","given":"Robert W."},{"family":"Dimand","given":"Mary Ann"}],"citation-key":"dimand_dimand__1994__neumann","container-title":"Game Theory and Economic Analysis. a Quiet Revolution in Economics","editor":[{"family":"Schmidt","given":"Christian"}],"ISBN":"978-0-415-25987-3","issued":{"date-parts":[[1994]]},"keyword":"#nosource;game-theory;collection::strategy::game-theory","language":"eng","title":"Von Neumann and Morgenstern in historical perspective","type":"chapter","URL":"https://www.researchgate.net/publication/4798823_Von_Neumann_and_Morgenstern_in_Historical_Perspective"},
  {"id":"eknow__2015__eknow","author":[{"family":"eKNOW","given":""}],"citation-key":"eknow__2015__eknow","contributor":[{"family":"International Academy, Research, and Industry Association","given":""}],"editor":[{"family":"Malzahn","given":"Dirk"},{"family":"Granja","given":"Conceição"}],"event-place":"Red Hook, NY","ISBN":"978-1-61208-386-5 978-1-5108-0034-2","issued":{"date-parts":[[2015]]},"keyword":"collection::strategy::ontology","language":"eng","number-of-pages":"175","publisher":"Curran Associates, Inc","publisher-place":"Red Hook, NY","source":"K10plus ISBN","title":"eKNOW 2015: the Seventh International Conference on Information, Process, and Knowledge Management: February 22-27, 2015, Lisbon, Portugal","title-short":"eKNOW 2015","type":"book"},
  {"id":"freedman__2013__strategy","abstract":"One of the world's leading authorities on war and international politics synthesizes the vast history of strategy's evolution in this consistently engaging and surprising account of how it came to pervade every aspect of life.","author":[{"family":"Freedman","given":"Lawrence"}],"citation-key":"freedman__2013__strategy","collection-title":"Oxford University Press","ISBN":"0-19-932515-4","issued":{"date-parts":[[2013,10,31]]},"keyword":"#nosource;__strategy2030:strategic-planning;collection::strategy::military;collection::strategy::definitions","language":"English","publisher":"Oxford University Press","title":"Strategy: A history.","title-short":"Strategy","type":"book"},
  {"id":"gamma_helm_etal__1994__design","author":[{"family":"Gamma","given":"Erich"},{"family":"Helm","given":"Richard"},{"family":"Johnson","given":"Ralph"},{"family":"Vlissides","given":"John"}],"citation-key":"gamma_helm_etal__1994__design","collection-title":"Addison-Wesley professional computing series","event-place":"Reading, Mass","ISBN":"978-0-201-63361-0","issued":{"date-parts":[[1994]]},"keyword":"#nosource;Computer software;Object-oriented programming (Computer science);Reusability;Software patterns;collection::strategy::software-engineering","language":"eng","number-of-pages":"395","publisher":"Addison-Wesley","publisher-place":"Reading, Mass","title":"Design patterns: elements of reusable object-oriented software","title-short":"Design patterns","type":"book","URL":"https://archive.org/details/designpatternsel00gamm/page/315/mode/2up"},
  {"id":"garrido_faria____design","abstract":"The growth of Web technologies and collaborative Web-based software as means of tapping and making useful knowledge and perception distributed among people, makes evident the potential interest and application of the paradigm of Socially Supported Decision Systems (SSDS) for organizations.","author":[{"family":"Garrido","given":"Paulo"},{"family":"Faria","given":"Nelson"}],"citation-key":"garrido_faria____design","keyword":"⛔ No DOI found","language":"en","source":"Zotero","title":"DESIGN OF A SOCIAL DECISION SUPPORT SYSTEM FOR ORGANIZATIONS","type":"article-journal"},
  {"id":"goodier_austin_etal__2010__causal","abstract":"Thinking and planning for the future is critical in a competitive business world. Scenarios are a common technique for investigating the future, but can be time-consuming and challenging to develop, particularly when more than a single organisation is involved. An approach is presented here which shifts the focus of scenario building from the company level to the sector level, whereby a range of organisations engage collectively on a topic of mutual importance. A rapid technique was developed, with simple scenarios being constructed in 2 to 4 hours. This process was implemented in 13 multi-organisational workshops with participants from the construction and building industries, sectors which are traditionally short-term and reactive in their outlook. The resulting feedback, observations and experiences are discussed, together with examples of how the resultant scenarios have been applied. An example of causal map reflection (exposing an individual’s causal map to others) is also presented, described and critiqued. It was found that the process was successful in engaging participants in thinking about and discussing the future, appreciating the interconnectivities of the related issues, and understanding the collective implications of their potential decisions, as well as facilitating the socialisation of participant thinking and the construction of collective futures.","accessed":{"date-parts":[[2021,2,22]]},"author":[{"family":"Goodier","given":"Chris"},{"family":"Austin","given":"Simon"},{"family":"Soetanto","given":"Robby"},{"family":"Dainty","given":"Andrew"}],"citation-key":"goodier_austin_etal__2010__causal","container-title":"Futures","container-title-short":"Futures","DOI":"10.1016/j.futures.2009.11.007","ISSN":"00163287","issue":"3","issued":{"date-parts":[[2010,4]]},"keyword":"collection::strategy::roadmapping","language":"en","page":"219-229","source":"DOI.org (Crossref)","title":"Causal mapping and scenario building with multiple organisations","type":"article-journal","URL":"https://linkinghub.elsevier.com/retrieve/pii/S0016328709001815","volume":"42"},
  {"id":"gorog__2013__strategicoriented","abstract":"Can a project be both a success and a failure? You may be hitting your deadlines and keeping within your budget... but if your project isn't meeting your organization's larger strategic goals, it may actually be failing. While it is broadly accepted that projects are the building blocks in implementing organizational strategic objectives, many books fail to address one critical question: how do you translate a strategic objective into a manageable project task? Lavishly illustrated with more than 40 figures and tables, this latest book from practitioner and project management professor Mih ly G r g, PhD addresses this critical lack, for project managers of all levels. With each of its chapters devoted to exploring a specific topic, the book begins by focusing on internal projects within an organization. Using real-world examples from multiple industries, Dr. G r g effortlessly provides both theory and practical tools for thinking and working strategically throughout the project process, including mastering scope challenges and evaluating project success. The second half of the book then explores how to meet the unique strategic challenges presented by projects involving external contractors and includes how to differentiate between contract and payment; allocate responsibilities and risks; create contractor competition; and identify the best bid (and bidder). Strategic Oriented Implementation of Projects is that rare book that is both strategic oriented and practical and provides project and program managers with the tools to ensure that their internal and external projects actually meet their organization's strategic goals.","author":[{"family":"Görög","given":"Mihály"}],"citation-key":"gorog__2013__strategicoriented","collection-title":"Project Management Institute","ISBN":"978-1-935589-87-7","issued":{"date-parts":[[2013]]},"keyword":"#nosource;__strategy2030:strategic-planning;collection::strategy::planning","language":"English","publisher":"Project Management Institute","title":"A Strategic-Oriented Implementation of Projects","type":"book"},
  {"id":"grant__2016__contemporary","abstract":"Brings together the text with an updated collection of 20+ case studies Introduces students to the core concepts and principles of strategy Combines a rigorous approach to business strategy analysis with highly relevant examples of current practice Includes access to high quality case and author video clips","author":[{"family":"Grant","given":"Robert M"}],"citation-key":"grant__2016__contemporary","collection-title":"John Wiley & Sons","ISBN":"1-119-12084-5","issued":{"date-parts":[[2016,1,5]]},"keyword":"#nosource;__strategy2030:strategic-planning;collection::strategy::management-theory","language":"English","publisher":"John Wiley & Sons","title":"Contemporary Strategy Analysis","type":"book"},
  {"id":"hannabarger_hannabarger_etal__2007__balanced","abstract":"Helps you focus on four areas to bring your business into balance. This work enables you to set and achieve goals consistently by using and applying balanced scorecards that work.","author":[{"family":"Hannabarger","given":"Chuck"},{"family":"Hannabarger","given":"Charles"},{"family":"Buchman","given":"Rick"},{"family":"Buchman","given":"Frederick"},{"family":"Economy","given":"Peter"}],"citation-key":"hannabarger_hannabarger_etal__2007__balanced","collection-title":"John Wiley & Sons","ISBN":"0-470-13397-X","issued":{"date-parts":[[2007,9,11]]},"keyword":"#nosource;__strategy2030:strategic-planning;__strategy2030:strategic-planning:balanced-scorecard;collection::strategy::planning","language":"English","publisher":"John Wiley & Sons","title":"Balanced Scorecard Strategy For Dummies","type":"book"},
  {"id":"hewitt__2018__technology","abstract":"Technologists who want their ideas heard, understood, and funded are often told to speak the language of business--without really knowing what that is. This book's toolkit provides architects, product managers, technology managers, and executives with a shared language--in the form of repeatable, practical patterns and templates--to produce great technology strategies. Author Eben Hewitt developed 39 patterns over the course of a decade in his work as CTO, CIO, and chief architect for several global tech companies. With these proven tools, you can define, create, elaborate, refine, and communicate your architecture goals, plans, and approach in a way that executives can readily understand, approve, and execute. This book covers: Architecture and strategy: Adopt a strategic architectural mindset to make a meaningful material impact Creating your strategy: Define the components of your technology strategy using proven patterns Communicating the strategy: Convey your technology strategy in a compelling way to a variety of audiences Bringing it all together: Employ patterns individually or in clusters for specific problems; use the complete framework for a comprehensive strategy","author":[{"family":"Hewitt","given":"Eben"}],"citation-key":"hewitt__2018__technology","collection-title":"O'Reilly Media","ISBN":"978-1-4920-4087-3","issued":{"date-parts":[[2018,10,25]]},"keyword":"#nosource;__strategy2030:strategic-planning;collection::strategy::definitions","language":"English","publisher":"O'Reilly Media","title":"Technology Strategy Patterns","type":"book","URL":"https://learning.oreilly.com/library/view/technology-strategy-patterns/9781492040866/"},
  {"id":"johnson__2013__project","abstract":"Projects have become the de facto method of implementing business strategy and operations. As such, understanding how projects relate to business strategy and managing projects strategically is increasingly important to effective and efficient business management This book is designed as a short and concise treatise on how to go about doing that. The authors start by figuring out how the project relates to the rest of the business and environment and what separates it from other projects and functions. They go on to discuss how you can use principles of strategic management to better organize and manage the various projects you may be dealing with on a daily basis so that they are strategic in nature. In essence, this book details how to approach answering the important strategic questions in project management like—“Why is the project being implemented? How does the project relate to the major strategic goals of the organization? How do we accomplish the performance goals for the project so that they help achieve the major strategic goals of the organization?”","author":[{"family":"Johnson","given":"William H A"}],"citation-key":"johnson__2013__project","collection-title":"Business Expert Press","ISBN":"1-60649-597-6","issued":{"date-parts":[[2013,5,20]]},"keyword":"#nosource;__strategy2030:strategic-planning;__strategy2030:strategic-planning:project-management;__strategy2030:strategic-planning:portfolio-management;collection::strategy::planning","language":"English","publisher":"Business Expert Press","title":"Project Strategy and Strategic Portfolio Management","type":"book"},
  {"id":"johnson_scholes_etal__2008__exploring","abstract":"Over 750,000students worldwidehave used this best-sellingbook to understand and explore strategic management through their academic and professional careers. Available in two versions (Text and Text & Cases), Exploring Corporate Strategyhas established a reputation as a pre-eminent textbook in its field, based upon the expertise of authorship, range of cases, depth of commentary and wealth of supporting resources. The 8th edition builds on these strengths, including coverage of key topic areas in this fast-moving discipline such as internationalisation, innovation and entrepreneurship. It is written for students of Strategic Management at all levels.","author":[{"family":"Johnson","given":"Gerry"},{"family":"Scholes","given":"Kevan"},{"family":"Whittington","given":"Richard"}],"citation-key":"johnson_scholes_etal__2008__exploring","collection-title":"Pearson Education","ISBN":"978-0-273-71192-6","issued":{"date-parts":[[2008,1,1]]},"keyword":"#nosource;__strategy2030:strategic-planning;collection::strategy::planning","language":"english","publisher":"Pearson Education","title":"Exploring Corporate Strategy","type":"book"},
  {"id":"juanluisdalmau-espert_llorens-largo_etal__2015__ontology","abstract":"From late 1980s and early twenty-first century, the environment where the organizations develop and act, has become increasingly uncertain and complex. Under these conditions, organizations have detected the need to move towards a more participatory model to address and reduce the complexity, based on information and knowledge as core assets to reduce environmental uncertainty and thereby ensure better decision-making. This new form of governance involves changes in the Strategic Planning process that are aligned with the characteristics of the new organizational model. Ontologies, as theories of content that allow the formalization of processes and knowledge, are a key element in this context. The aim of this paper is to formally define an ontology that could be defined in the future using the Web Ontology Language (OWL) that meets the standards approved by the World Wide Web Consortium (W3C) and that is used to formalize the process of SP, as well as the knowledge that is created and flows among the several participants in the process.","author":[{"literal":"Juan Luis Dalmau-Espert"},{"family":"Llorens-Largo","given":"Faraón"},{"family":"Molina-Carmona","given":"Rafael"}],"citation-key":"juanluisdalmau-espert_llorens-largo_etal__2015__ontology","container-title":"eKNOW 2015: the Seventh International Conference on Information, Process, and Knowledge Management: February 22-27, 2015, Lisbon, Portugal","event-place":"Red Hook, NY","ISBN":"978-1-61208-386-5 978-1-5108-0034-2","issued":{"date-parts":[[2015]]},"keyword":"#nosource;collection::strategy::ontology","language":"eng","publisher":"Curran Associates, Inc","publisher-place":"Red Hook, NY","source":"K10plus ISBN","title":"An Ontology for Formalizing and Automating the Strategic Planning Process","type":"chapter"},
  {"id":"kaplan_norton__2004__strategy","abstract":"Der Trend setzt sich fort. Mit Strategy Maps kann das Balanced-Scorecard-System noch wirkungsvoller eingesetzt werden. Wie funktioniert das? Die Strategy Maps entwickeln Ursache-Wirkungs-Ketten. Sie legen offen, welche strategischen Entscheidungen zu welchen messbaren Ergebnissen führen. Strategy Maps beruhen auf einer einfachen Philosophie: Man kann nur umsetzen, was man messen kann. Man kann nur messen, was man beschreiben kann. In der Praxis helfen die Strategy Maps, verständlich zu kommunizieren. Die Strategy Maps zeichnen den Ablaufplan auf, nach dem die Zielvorgaben umgesetzt werden sollen. Sie bieten eine ideale Unterstützung, weil immaterielle Vermögenswerte wie das Human-, Informations- und Organisationskapital in die Strategie eingebunden werden müssen. Das Konzept der Erfolgsautoren Kaplan und Norton ist ein Meilenstein für die strategische Unternehmensführung.","author":[{"family":"Kaplan","given":"Robert S"},{"family":"Norton","given":"David P"}],"citation-key":"kaplan_norton__2004__strategy","ISBN":"978-3-7910-2239-0","issued":{"date-parts":[[2004]]},"keyword":"#nosource;__strategy2030:strategic-planning;__strategy2030:strategic-planning:strategy-maps;collection::strategy::roadmapping","language":"english","publisher":": Harvard Business Review Press","title":"Strategy maps","type":"book"},
  {"id":"knuth_plass__1981__breaking","abstract":"Abstract This paper discusses a new approach to the problem of dividing the text of a paragraph into lines of approximately equal length. Instead of simply making decisions one line at a time, the method considers the paragraph as a whole, so that the final appearance","author":[{"family":"Knuth","given":"Donald E"},{"family":"Plass","given":"Michael F"}],"citation-key":"knuth_plass__1981__breaking","container-title":"Software: Practice and Experience","DOI":"10.1002/spe.4380111102","issue":"11","issued":{"date-parts":[[1981,11]]},"keyword":"_has-setting:academic;_has-format:article;collection::strategy::software-engineering","language":"en","page":"1119-1184","title":"Breaking paragraphs into lines","type":"article-journal","URL":"http://doi.wiley.com/10.1002/spe.4380111102","volume":"11"},
  {"id":"mintzberg__1978__patterns","abstract":"The literature on strategy formation is in large part theoretical but not empirical, and the usual definition of “strategy” encourages the notion that strategies, as we recognize them ex post facto, are deliberate plans conceived in advance of the making of specific decisions. By defining a strategy as “a pattern in a stream of decisions,” we are able to research strategy formation in a broad descriptive context. Specifically, we can study both strategies that were intended and those that were, realized .despite intentions. A research program suggested by this definition is outlined, and two of the completed studies are then reviewed—the strategies of Volkswagenwerk from 1934 to 1974 and of the United States government in Vietnam from 1950 to 1973. Some general conclusions suggested by these studies are then presented in terms of three central themes: that strategy formation can fruitfully be viewed as the interplay between a dynamic environment and bureaucratic momentum, with leadership mediating between...","author":[{"family":"Mintzberg","given":"Henry"}],"citation-key":"mintzberg__1978__patterns","container-title":"Management Science","DOI":"10.1287/mnsc.24.9.934","issue":"9","issued":{"date-parts":[[1978,5,1]]},"keyword":"#nosource;__strategy2030:strategic-planning;collection::strategy::military;collection::strategy::management-theory","language":"English","page":"934-948","title":"Patterns in Strategy Formation","type":"article-journal","URL":"https://www.researchgate.net/publication/227444830_Patterns_in_Strategy_Formation","volume":"24"},
  {"id":"mintzberg_ahlstrand_etal__1998__strategy","author":[{"family":"Mintzberg","given":"Henry"},{"family":"Ahlstrand","given":"Bruce W."},{"family":"Lampel","given":"Joseph"}],"call-number":"HD30.28 .M564 1998","citation-key":"mintzberg_ahlstrand_etal__1998__strategy","event-place":"New York","ISBN":"978-0-684-84743-6","issued":{"date-parts":[[1998]]},"keyword":"Strategic planning;collection::strategy::management-theory","number-of-pages":"406","publisher":"Free Press","publisher-place":"New York","source":"Library of Congress ISBN","title":"Strategy safari: a guided tour through the wilds of strategic management","title-short":"Strategy safari","type":"book"},
  {"id":"mueller-stewens_gillenkirch__2018__strategie","author":[{"family":"Müller-Stewens","given":"Günter"},{"family":"Gillenkirch","given":"Robert"}],"citation-key":"mueller-stewens_gillenkirch__2018__strategie","container-title":"Gablers Wirtschaftslexikon","issued":{"date-parts":[[2018,2,19]]},"keyword":"collection::strategy::management-theory","language":"de-DE","title":"Strategie","type":"entry-encyclopedia","URL":"https://wirtschaftslexikon.gabler.de/definition/strategie-43591/version-266920"},
  {"id":"olsen__2011__strategic","abstract":"Providing practical, field-tested techniques and a complete 6-phase plan, this guide shows you how to make strategy a habit for all organizations, no matter the size, type, or resource constraints.","author":[{"family":"Olsen","given":"Erica"}],"citation-key":"olsen__2011__strategic","collection-title":"John Wiley & Sons","ISBN":"1-118-07777-6","issued":{"date-parts":[[2011,11,15]]},"keyword":"#nosource;__strategy2030:strategic-planning;collection::strategy::planning","language":"English","publisher":"John Wiley & Sons","title":"Strategic Planning Kit For Dummies","type":"book"},
  {"id":"parker__1990__creating","author":[{"family":"Parker","given":"Marjorie"}],"citation-key":"parker__1990__creating","collection-title":"Dialog Intl","ISBN":"978-0-9630000-0-2","issued":{"date-parts":[[1990,1,1]]},"keyword":"#nosource;__strategy2030:strategic-planning;collection::strategy::planning","language":"English","publisher":"Dialog Intl","title":"Creating shared vision","type":"book"},
  {"id":"porter__1979__what","author":[{"family":"Porter","given":"M.E."}],"citation-key":"porter__1979__what","container-title":"Harvard Business Review","issued":{"date-parts":[[1979]]},"keyword":"#nosource;__strategy2030:strategic-planning;collection::strategy::management-theory","language":"english","note":"https://www.academia.edu/16509196/M_Porter_What_is_Strategy","page":"61-79","title":"What is strategy?","type":"article-magazine","URL":"https://learning.oreilly.com/library/view/hbrs-10-must/9781422172056/","volume":"74"},
  {"id":"porter__1985__competitive","author":[{"family":"Porter","given":"Michael E."}],"call-number":"HD41 .P668 1985","citation-key":"porter__1985__competitive","event-place":"New York : London","ISBN":"978-0-02-925090-7","issued":{"date-parts":[[1985]]},"keyword":"Competition;Industrial management;collection::strategy::management-theory","number-of-pages":"557","publisher":"Free Press ; Collier Macmillan","publisher-place":"New York : London","source":"Library of Congress ISBN","title":"Competitive advantage: creating and sustaining superior performance","title-short":"Competitive advantage","type":"book"},
  {"id":"porter__1989__how","abstract":"The essence of strategy formulation is coping with competition. Yet it is easy to view competition too narrowly and too pessimistically. While one sometimes hears executives complaining to the contrary, intense competition in an industry is neither coincidence nor bad luck.","author":[{"family":"Porter","given":"Michael E."}],"citation-key":"porter__1989__how","container-title":"Readings in strategic management","DOI":"10.1007/978-1-349-20317-8₁0","editor":[{"family":"Asch","given":"David"},{"family":"Bowman","given":"Cliff"}],"event-place":"London","ISBN":"978-1-349-20317-8","issued":{"date-parts":[[1989]]},"keyword":"collection::strategy::management-theory","page":"133–143","publisher":"Macmillan Education UK","publisher-place":"London","title":"How competitive forces shape strategy","type":"chapter","URL":"https://doi.org/10.1007/978-1-349-20317-8₁0"},
  {"id":"porter__2008__five","abstract":"Awareness of the five forces can help a company understand the structure of its industry and stake out a position that is more profitable and less vulnerable to attack.","author":[{"family":"Porter","given":"Michael E."}],"citation-key":"porter__2008__five","container-title":"Harvard Business Review","issue":"1","issued":{"date-parts":[[2008]]},"keyword":"collection::strategy::management-theory","page":"78-93","title":"The Five Competitive Forces That Shape Strategy","type":"article-magazine","volume":"88"},
  {"id":"rainey__2014__understanding","abstract":"This revised edition of the best–selling text in the field includes a guiding framework of organizational analysis emphasizing the integration and coordination of the domains of the organization with the motivations, work attitudes, and behaviors of the people who lead them. Includes new research and practice from the US and internationally in collaboration and networks, innovation, process improvement through IT, open government and citizen participation, customer service, and a provides a greater emphasis on management practice through illustrative examples of those who are leading successful change efforts.","author":[{"family":"Rainey","given":"Hal G"}],"citation-key":"rainey__2014__understanding","collection-title":"John Wiley & Sons","ISBN":"978-1-118-58371-5","issued":{"date-parts":[[2014,2,3]]},"keyword":"#nosource;__strategy2030:strategic-planning;__strategy2030:strategic-planning:nonprofit-organizations;collection::strategy::non-profit","language":"English","publisher":"John Wiley & Sons","title":"Understanding and Managing Public Organizations","type":"book"},
  {"id":"ramirez_churchhouse_etal__2017__using","abstract":"Rather than trying to predict the future, organizations need to strengthen their abilities to cope with uncertainty. A new approach to scenario planning can help companies reframe their long-term strategies by developing several plausible scenarios.","author":[{"family":"Ramirez","given":"R"},{"family":"Churchhouse","given":"S"},{"family":"Palermo","given":"A"},{"family":"Hoffmann","given":"J"}],"citation-key":"ramirez_churchhouse_etal__2017__using","container-title":"MIT Sloan Management Review","issue":"4","issued":{"date-parts":[[2017,6,13]]},"keyword":"__strategy2030:strategic-planning;__strategy2030:strategic-planning:forecasting;__strategy2030:strategic-planning:scenario-based-plannning;collection::strategy::planning","language":"english","title":"Using scenario planning to reshape strategy","type":"article-journal","URL":"https://sloanreview.mit.edu/article/using-scenario-planning-to-reshape-strategy/","volume":"58"},
  {"id":"review__2018__hbr","abstract":"Bring strategy into your daily work. It's your responsibility as a manager to ensure that your work--and the work of your team--aligns with the overarching objectives of your organization. But when you're faced with competing projects and limited time, it's difficult to keep strategy front of mind. How do you keep your eye on the long term amid a sea of short-term demands? The HBR Guide to Thinking Strategically provides practical advice and tips to help you see the big-picture perspective in every aspect of your daily work, from making decisions to setting team priorities to attacking your own to-do list. You'll learn how to: Understand your organization's strategy Align your team around key objectives Focus on the priorities that matter most Spot trends in your company and in your industry Consider future outcomes when making decisions Manage trade-offs Embrace a leadership mindset","citation-key":"review__2018__hbr","collection-title":"Harvard Business Press","editor":[{"family":"Review","given":"Harvard Business"}],"ISBN":"1-63369-694-4","issued":{"date-parts":[[2018,12,18]]},"keyword":"#nosource;__strategy2030:strategic-planning;collection::strategy::management-theory","language":"English","publisher":"Harvard Business Press","title":"HBR Guide to Thinking Strategically (HBR Guide Series)","type":"book"},
  {"id":"review__2020__hbr","abstract":"This big initiative could make or break this fiscal year--or your career. Managing a successful strategic initiative may be the key to transforming your company--and propelling your career forward. Yet running a cross-functional team on a high-profile project can present a multitude of challenges and risks, causing even the most experienced manager to struggle. The HBR Guide to Managing Strategic Initiatives provides practical tips and advice to help you manage all the stages of an initiative's life cycle, from buy-in to launch to scaling up. You'll learn how to: Win--and keep--support for your new initiative Move rapidly from approval to implementation Assemble transformative, high-performing initiative teams Maintain the confidence of sponsors and stakeholders Stay on schedule and within budget Avoid initiative overload by killing projects that aren't meeting business needs Keep multiple initiatives in strategic alignment Arm yourself with the advice you need to succeed on the job, from a source you trust. Packed with how-to essentials from leading experts, the HBR Guides provide smart answers to your most pressing work challenges.","citation-key":"review__2020__hbr","collection-title":"Harvard Business Press","editor":[{"family":"Review","given":"Harvard Business"}],"issued":{"date-parts":[[2020,2,11]]},"keyword":"#nosource;__strategy2030:strategic-planning;collection::strategy::management-theory","language":"English","publisher":"Harvard Business Press","title":"HBR Guide to Managing Strategic Initiatives","type":"book"},
  {"id":"review_porter_etal__2011__hbr","author":[{"family":"Review","given":"H.B."},{"family":"Porter","given":"M.E."},{"family":"Kim","given":"W.C."},{"family":"Mauborgne","given":"R.A."}],"citation-key":"review_porter_etal__2011__hbr","ISBN":"978-1-4221-7205-6","issued":{"date-parts":[[2011]]},"keyword":"#nosource;__strategy2030:strategic-planning;collection::strategy::management-theory","language":"english","publisher":"Harvard Business Press","title":"HBR's 10 Must Reads on Strategy (including featured article \"What Is Strategy?\" by Michael E. Porter)","type":"book","URL":"https://learning.oreilly.com/library/view/hbrs-10-must/9781422172056/"},
  {"id":"ricard__2013__roadmapping","abstract":"The PhD thesis focuses on the coordination of technology-intensive innovation activities at both sector and firm levels, supported by the use of the strategic roadmapping method. Investigations combine qualitative and quantitative research methods; using a narrative approach in the form of interviews to uncover innovation and technology barriers, and a social network analysis of stakeholders’ role in relation to two technology platforms during a five-year period when the roadmaps 2020 were developed. In this respect, the thesis emphasizes the view of innovation as an interactive process to develop competences among technology users, producers, research institutions, and politicians. As a result, knowledge on how the platforms evolved, and their dynamics, provide new reflections on the innovation systems approach: that connectivity seems to change along the changes in problem. This is how the players create new knowledge. Thus, the identification of political and technical barriers is important selection mechanisms in how connectivity grows and changes. The thesis, furthermore, includes practical experience and account of roadmap development at the firm level providing reflections on dynamic capabilities. Understanding roadmapping has been a journey in this research showing that there is no ‘one size fits all’. Rather the strength of roadmapping lies in the participatory process and in the action-oriented, systematic framework that aligns layers of information while moving from a current position to a desired future.","author":[{"family":"Ricard","given":"Lykke Margot"}],"citation-key":"ricard__2013__roadmapping","DOI":"10.13140/RG.2.1.1221.0966/1","genre":"PhD Thesis","issued":{"date-parts":[[2013]]},"keyword":"#nosource;__strategy2030:strategic-planning:roadmapping;collection::strategy::roadmapping","publisher":"Technical University of Denmark","title":"Roadmapping and Strategy in Science, Technology and Innovation: Why connectivity matters","type":"thesis"},
  {"id":"roberts__2012__strategic","abstract":"Strategic Project Management uses real life case examples to characterize and describe the organizational factors and conditions necessary for projects to thrive and to deliver the organization's strategic objectives. This characterization is formed around ten imperatives which senior managers can implement - both within individual projects and, even more crucially, within the institutions that sponsor them - using the tools provided. Accessible, practical and free of jargon, Strategic Project Management offers the solutions needed to successfully prioritize and manage a portfolio of projects, communicate aims, align priorities to organizational objectives, evaluate progress, manage supplier relationships and anticipate and mitigate the risks at every stage. Supported by a comprehensive package of online resources for project portfolio planning, management and analysis this book will help readers to build on their skills, knowledge and confidence to rise to the challenge of governing and delivering successful projects.","author":[{"family":"Roberts","given":"Paul"}],"citation-key":"roberts__2012__strategic","collection-title":"Kogan Page Publishers","ISBN":"0-7494-6434-8","issued":{"date-parts":[[2012,7,3]]},"keyword":"#nosource;__strategy2030:strategic-planning;__strategy2030:strategic-planning:project-management;collection::strategy::planning","language":"English","publisher":"Kogan Page Publishers","title":"Strategic Project Management","type":"book"},
  {"id":"ronalds_vatananan_nathasitgerdsri__2012__current","abstract":"Technology roadmapping (TRM) is gaining momentum as a strategic management tool for an organization to integrate technology into business strategy. This paper reviews over a hundred of TRM related publications to provide the community with the current state of roadmapping researches and practices. From the literature, the issue of keeping a roadmap alive is identified as the key challenge in the field. To address this challenge, operationalization and effective implementation of TRM are emphasized as potential areas for future research.","accessed":{"date-parts":[[2020,1,14]]},"author":[{"literal":"Ronald S. Vatananan"},{"literal":"Nathasit Gerdsri"}],"citation-key":"ronalds_vatananan_nathasitgerdsri__2012__current","container-title":"International Journal of Innovation and Technology Management","container-title-short":"Int. J. Innovation Technol. Management","DOI":"10.1142/S0219877012500320","ISSN":"0219-8770, 1793-6950","issue":"04","issued":{"date-parts":[[2012,8]]},"keyword":"__strategy2030:strategic-planning:roadmapping;collection::strategy::roadmapping","language":"en","page":"1250032","source":"DOI.org (Crossref)","title":"The current state of technology roadmapping (TRM) research and practice","type":"article-journal","URL":"https://www.worldscientific.com/doi/abs/10.1142/S0219877012500320","volume":"09"},
  {"id":"roper_cunningham_etal__2011__forecasting","abstract":"Forecasting Continues Implementation Issues Strategic Planning for Technology Implementation Selecting from Among Alternative Implementations of the Technology Technology Roadmapping Summary and Concluding Observations References","author":[{"family":"Roper","given":"Alan Thomas"},{"family":"Cunningham","given":"Scott W"},{"family":"Porter","given":"Alan L"},{"family":"Mason","given":"Thomas W"},{"family":"Rossini","given":"Frederick A"},{"family":"Banks","given":"Jerry"}],"citation-key":"roper_cunningham_etal__2011__forecasting","ISBN":"978-0-470-44090-2","issued":{"date-parts":[[2011]]},"keyword":"#nosource;__strategy2030:strategic-planning;__strategy2030:strategic-planning:forecasting;collection::strategy::roadmapping","language":"english","title":"Forecasting and Management of Technology","type":"book"},
  {"id":"ross__2021__game","author":[{"family":"Ross","given":"Don"}],"citation-key":"ross__2021__game","container-title":"The Stanford encyclopedia of philosophy","edition":"Fall 2021","editor":[{"family":"Zalta","given":"Edward N."}],"issued":{"date-parts":[[2021]]},"keyword":"collection::strategy::game-theory","publisher":"Metaphysics Research Lab, Stanford University","title":"Game theory","type":"chapter","URL":"https://plato.stanford.edu/archives/fall2021/entries/game-theory/"},
  {"id":"scavarda_bouzdine-chameeva_etal__2006__methodology","accessed":{"date-parts":[[2021,2,22]]},"author":[{"family":"Scavarda","given":"Annibal Jose"},{"family":"Bouzdine-Chameeva","given":"Tatiana"},{"family":"Goldstein","given":"Susan Meyer"},{"family":"Hays","given":"Julie M."},{"family":"Hill","given":"Arthur V."}],"citation-key":"scavarda_bouzdine-chameeva_etal__2006__methodology","container-title":"Decision Sciences","container-title-short":"Decision Sciences","DOI":"10.1111/j.1540-5915.2006.00124.x","ISSN":"0011-7315, 1540-5915","issue":"2","issued":{"date-parts":[[2006,5]]},"keyword":"collection::strategy::roadmapping","language":"en","page":"263-283","source":"DOI.org (Crossref)","title":"A Methodology for Constructing Collective Causal Maps*","type":"article-journal","URL":"http://doi.wiley.com/10.1111/j.1540-5915.2006.00124.x","volume":"37"},
  {"id":"scavarda_bouzdine-chameeva_etal__2006__methodologya","accessed":{"date-parts":[[2023,3,14]]},"author":[{"family":"Scavarda","given":"Annibal Jose"},{"family":"Bouzdine-Chameeva","given":"Tatiana"},{"family":"Goldstein","given":"Susan Meyer"},{"family":"Hays","given":"Julie M."},{"family":"Hill","given":"Arthur V."}],"citation-key":"scavarda_bouzdine-chameeva_etal__2006__methodologya","container-title":"Decision Sciences","container-title-short":"Decision Sciences","DOI":"10.1111/j.1540-5915.2006.00124.x","ISSN":"0011-7315, 1540-5915","issue":"2","issued":{"date-parts":[[2006,5]]},"keyword":"","language":"en","note":"48 citations (Crossref) [2023-03-14]","page":"263-283","source":"DOI.org (Crossref)","title":"A Methodology for Constructing Collective Causal Maps*","type":"article-journal","URL":"https://onlinelibrary.wiley.com/doi/10.1111/j.1540-5915.2006.00124.x","volume":"37"},
  {"id":"schmidt__2002__game","call-number":"HB144 .G3727 2002","citation-key":"schmidt__2002__game","collection-number":"1","collection-title":"Routledge advances in game theory","editor":[{"family":"Schmidt","given":"Christian"}],"event-place":"London ; New York","ISBN":"978-0-415-25987-3","issued":{"date-parts":[[2002]]},"keyword":"Economics;Game theory;/unread;collection::strategy::game-theory","language":"eng","number-of-pages":"193","publisher":"Routledge","publisher-place":"London ; New York","source":"Library of Congress ISBN","title":"Game theory and economic analysis","type":"book"},
  {"id":"schmidt__2009__strategic","abstract":"When Fortune Magazine estimated that 70% of all strategies fail, it also noted that most of these strategies were basically sound, but could not be executed. The central premise of Strategic Project Management Made Simple is that most projects and strategies never get off the ground because of adhoc, haphazard, and obsolete methods used to turn their ideas into coherent and actionable plans. Strategic Project Management Made Simple is the first book to couple a step-by-step process with an interactive thinking tool that takes a strategic approach to designing projects and action initiatives. Strategic Project Management Made Simple builds a solid platform upon four critical questions that are vital for teams to intelligently answer in order to create their own strong, strategic foundation. These questions are: 1. What are we trying to accomplish and why? 2. How will we measure success? 3. What other conditions must exist? 4. How do we get there? This fresh approach begins with clearly understanding the what and why of a project - comprehending the bigger picture goals that are often given only lip service or cursory reviews. The second and third questions clarify success measures and identify the risky assumptions that can later cause pain if not spotted early. The how questions - what are the activities, budgets, and schedules - comes last in our four-question system. By contrast, most project approaches prematurely concentrate on the how without first adequately addressing the three other questions. These four questions guide readers into fleshing out a simple, yet sophisticated, mental workbench called \"the Logical Framework\" - a Systems Thinking paradigm that lays out one's own project strategy in an easily accessible, interactive 4x4 matrix. The inclusion of memorable features and concepts (four critical questions, LogFrame matrix, If-then thinking, and Implementation Equation) make this book unique.","author":[{"family":"Schmidt","given":"Terry"}],"citation-key":"schmidt__2009__strategic","collection-title":"John Wiley & Sons","ISBN":"0-470-41158-9","issued":{"date-parts":[[2009,2,9]]},"keyword":"#nosource;__strategy2030:strategic-planning;__strategy2030:strategic-planning:project-management;collection::strategy::planning","language":"English","publisher":"John Wiley & Sons","title":"Strategic Project Management Made Simple","type":"book"},
  {"id":"sep-definitions","author":[{"family":"Gupta","given":"Anil"}],"citation-key":"sep-definitions","container-title":"The Stanford encyclopedia of philosophy","edition":"Summer 2021","editor":[{"family":"Zalta","given":"Edward N."}],"issued":{"date-parts":[[2021]]},"keyword":"#nosource;collection::strategy::definitions","publisher":"Metaphysics Research Lab, Stanford University","title":"Definitions","type":"chapter","URL":"https://plato.stanford.edu/archives/sum2021/entries/definitions/"},
  {"id":"simonse_buijs_etal__2012__visual","abstract":"Road map:”1: a map showing roads especially for automobile travel. 2. a : a detailed plan to guide progress toward a goal; b: a detailed explanation. (MeriamWebster.com Dictionary, 2008)\nThe roadmap we use for navigating in the car, bringing us from A to B, showing alternative routes, provides a strong metaphor (Meyer, 1984; Cornelissen, 2005) for a\nroadmap used by practitioners. – Strategy is a journey, purposes are destinations, means are\nroutes, and achievements are landmarks. - Strategic dialogues and conversations with this\nfigure of speech do not only cover linguistical aspects but in a broad view cover a complex,\ninformation-rich mix of auditory, visual, olfactory, and tactile events ( Ford & Ford, 1995). In\nroadmapping the visual mapping of contributions of the participants is assumed to be crucial.\nMetaphors of roadmaps inspired numerous practitioners, to execute a roadmapping process.\nMaps and strategic dialogues in roadmapping are assumed to be interrelated. In our research\nwe explored the wealth of clarifications and explanations that have been put forward by\nroadmapping practioners in their publications for the purpose of establishing and exchanging\nbest practices such as Industry networks EIRMA in Europe (Groenveld, 1997; Phaal ea, 2008;\nMohrle & Isenmann, 2005) and SEMATECH in the US (Browning, ea., 1995; Burgelman,\n2002). We reviewed twelve stories with anecdotic evidence of roadmapping practice at\nglobal firms like Motorola, Philips, Lucent, Siemens, Honneywell etc. (Willyard & McClees,\n1984; Groenveld, 1997; Albright & Kappel,2003; Farrokhzad et.al., 2005; Whalen, 2007 ). In this paper we captured their insights, deducted, confronted and joined these with\nexisting theory concepts of Innovation, Design and Strategic literature. By inductive research\nwe have built concepts and found that visuals are of key importance. Visual attributes are\ngrounded in the concept of a roadmap. And visual mapping is of key importance in the\nconsensus building dialogue of roadmapping. In this short paper our qualitative findings and\nreflection are presented.","author":[{"family":"Simonse","given":"Lianne"},{"family":"Buijs","given":"Jan"},{"family":"Hultink","given":"Erik"}],"citation-key":"simonse_buijs_etal__2012__visual","event-place":"Helsinki","event-title":"28th EGOS Colloquium 2012, Helsinki","issued":{"date-parts":[[2012,7,6]]},"keyword":"#nosource;__strategy2030:strategic-planning:roadmapping;collection::strategy::roadmapping","publisher-place":"Helsinki","title":"Visual portrays of roadmaps","type":"paper-conference"},
  {"id":"suntzu__2004__kunst","abstract":"Sunzi schrieb dieses außergewöhnliche Buch vor zweieinhalbtausend Jahren in China. Es beginnt mit den Worten: Die Kunst des Krieges ist für den Staat von entscheidender Bedeutung. Sie ist eine Angelegenheit von Leben und Tod, eine Straße, die zur Sicherheit oder in den Untergang führt. Deshalb darf sie unter keinen Umständen vernachlässigt werden.","author":[{"family":"Sun Tzu","given":"Wu"}],"citation-key":"suntzu__2004__kunst","issued":{"date-parts":[[2004,6,18]]},"keyword":"#nosource;__strategy2030:strategic-planning;collection::strategy::military","language":"de-DE","title":"Die Kunst des Krieges","type":"book","URL":"https://archive.org/details/SunTzuDieKunstDesKrieges"},
  {"id":"suntzu__2008__sun","author":[{"family":"Sun Tzu","given":"Wu"}],"citation-key":"suntzu__2008__sun","ISBN":"978-0-8048-3944-0","issued":{"date-parts":[[2008]]},"keyword":"China;Early works to 1800;Military art and science;collection::strategy::military","language":"en-US","number-of-pages":"188","publisher":"Tuttle Publishing","title":"Sun Tzu's the Art of War. Bilingual edition with complete Chinese and English text.","type":"book","URL":"https://archive.org/details/suntzusartofwar0000sunz/page/n7/mode/2up"},
  {"id":"vinayavekhin_phaal__2019__synchronization","abstract":"The research question is “How can firms approach synchronization in strategic planning?”, aiming to investigate opportunities for improved synchronization within strategic planning. The focus is on roadmapping, as a relatively simple, flexible and widely used method that includes time as an explicit dimension. The adopted methodology is a process approach, consisting of literature review, exploratory interviews, practitioner interviews, and case studies with large multinational firms based in the UK that are familiar with roadmapping. As a result, four types of synchronization have been identified and discussed, including generic forms of each type, illustrated with industrial examples from the case studies.","accessed":{"date-parts":[[2020,1,14]]},"author":[{"family":"Vinayavekhin","given":"Sukrit"},{"family":"Phaal","given":"Robert"}],"citation-key":"vinayavekhin_phaal__2019__synchronization","container-title":"International Journal of Innovation and Technology Management","container-title-short":"Int. J. Innovation Technol. Management","DOI":"10.1142/S0219877019500445","ISSN":"0219-8770, 1793-6950","issue":"06","issued":{"date-parts":[[2019,10]]},"keyword":"#nosource;__strategy2030:strategic-planning:roadmapping;collection::strategy::roadmapping","language":"en","note":"http://web.archive.org/web/20200114175814/https://www.worldscientific.com/action/cookieAbsent","page":"1950044","source":"DOI.org (Crossref)","title":"Synchronization in Strategic Planning: A Roadmapping Framework","title-short":"Synchronization in Strategic Planning","type":"article-journal","URL":"10.1142/S0219877019500445","volume":"16"},
  {"id":"virine_trumper__2019__project","abstract":"This new edition gives project managers practical methods and tools to make the right decisions while juggling multiple objectives, risks and uncertainties, and stakeholders. Project management requires you to navigate a maze of multiple and complex decisions that are an everyday part of the job. To be effective, you must know how to make rational choices with your projects, what processes can help to improve these choices, and what tools are available to help you with decision-making. An entertaining and easy-to-read guide to a structured project decision-making process, Project Decisions will help you identify risks and perform basic quantitative and qualitative risk and decision analyses. Lev Virine and Michael Trumper use their understanding of basic human psychology to show you how to use event chain methodology, establish creative business environments, and estimate project time and costs. Each phase of the process is described in detail, including a review of both its psychological aspects and quantitative methods.","author":[{"family":"Virine","given":"Lev"},{"family":"Trumper","given":"Michael"}],"citation-key":"virine_trumper__2019__project","collection-title":"Berrett-Koehler Publishers","ISBN":"1-5230-8546-0","issued":{"date-parts":[[2019,11,5]]},"keyword":"#nosource;__strategy2030:strategic-planning;__strategy2030:strategic-planning:decision-making;__strategy2030:strategic-planning:project-management;collection::strategy::planning","language":"English","publisher":"Berrett-Koehler Publishers","title":"Project Decisions, 2nd Edition","type":"book"},
  {"id":"vonneumann_morgenstern__1953__theory","author":[{"family":"Neumann","given":"John","non-dropping-particle":"von"},{"family":"Morgenstern","given":"Oskar"}],"citation-key":"vonneumann_morgenstern__1953__theory","edition":"Third edition","issued":{"date-parts":[[1953]]},"keyword":"game-theory;collection::strategy::game-theory","language":"eng","number-of-pages":"668","publisher":"Princeton University Press","title":"Theory of games and economic behavior","type":"book"},
  {"id":"wikiepedia__2023__strategy","abstract":"Strategy (from Greek στρατηγία stratēgia, \"art of troop leader; office of general, command, generalship\") is a general plan to achieve one or more long-term or overall goals under conditions of uncertainty. In the sense of the \"art of the general\", which included several subsets of skills including military tactics, siegecraft, logistics etc., the term came into use in the 6th century C.E. in Eastern Roman terminology, and was translated into Western vernacular languages only in the 18th century. From then until the 20th century, the word \"strategy\" came to denote \"a comprehensive way to try to pursue political ends, including the threat or actual use of force, in a dialectic of wills\" in a military conflict, in which both adversaries interact.Strategy is important because the resources available to achieve goals are usually limited. Strategy generally involves setting goals and priorities, determining actions to achieve the goals, and mobilizing resources to execute the actions. A strategy describes how the ends (goals) will be achieved by the means (resources). Strategy can be intended or can emerge as a pattern of activity as the organization adapts to its environment or competes. It involves activities such as strategic planning and strategic thinking.Henry Mintzberg from McGill University defined strategy as a pattern in a stream of decisions to contrast with a view of strategy as planning, while Henrik von Scheel defines the essence of strategy as the activities to deliver a unique mix of value – choosing to perform activities differently or to perform different activities than rivals. while Max McKeown (2011) argues that \"strategy is about shaping the future\" and is the human attempt to get to \"desirable ends with available means\". Vladimir Kvint defines strategy as \"a system of finding, formulating, and developing a doctrine that will ensure long-term success if followed faithfully.\" Complexity theorists define strategy as the unfolding of the internal and external aspects of the organization that results in actions in a socio-economic context.","accessed":{"date-parts":[[2023,3,14]]},"citation-key":"wikiepedia__2023__strategy","container-title":"Wikipedia","editor":[{"literal":"Wikiepedia"}],"issued":{"date-parts":[[2023,1,19]]},"keyword":"collection::strategy::management-theory","language":"en","note":"Page Version ID: 1134633684","source":"Wikipedia","title":"Strategy","type":"entry-encyclopedia","URL":"https://en.wikipedia.org/w/index.php?title=Strategy&oldid=1134633684"},
  {"id":"wilkinson_kupers__2013__living","abstract":"How scenario planning changed corporate strategy","accessed":{"date-parts":[[2020,2,7]]},"author":[{"family":"Wilkinson","given":"Angela"},{"family":"Kupers","given":"Roland"}],"citation-key":"wilkinson_kupers__2013__living","container-title":"Harvard Business Review","ISSN":"0017-8012","issue":"May 2013","issued":{"date-parts":[[2013,5,1]]},"keyword":"__strategy2030:strategic-planning;__strategy2030:strategic-planning:scenario-based-plannning;collection::strategy::planning","language":"english","note":"http://web.archive.org/web/20200207094551/https://hbr.org/2013/05/living-in-the-futures","source":"hbr.org","title":"Living in the Futures","type":"article-journal","URL":"https://hbr.org/2013/05/living-in-the-futures"},
  {"id":"yakan_rashid__2016__strategic","abstract":"In an era of dynamic and turbulent environment, organizations have to stand face to high and unexpected competitions. Knowledge Management plays a critical role, helps organizations to deeply understand the rapidly changing world and withstand threats, while investing opportunities. This is not attainable unless the organization develops its strategies based on a robust but flexible conceptual business structure that updates itself with the changing variables of environments. Strategy is often defined as a unique plan of action designed to achieve a specific goal. Planning is a cornerstone of strategic thinking of work, whether short or long-range plan. The organization needs a strategic plan to succeed. This plan is considered as a collection of blueprints, schedules, information, facts, opinions, and knowledge to create a business model to give a clear and specific vision for the organization. Every organization requires a group of experts to design its strategic plan. This plan is meant to improve and enhance skills and capabilities of the organization, to build the general compatible model, and to fit with other models throughout the world in order to achieve the organization goals. Ontology is the most important element for building the knowledge tree and creating the business model. For this purpose, this research is aiming to develop a state of the art Strategic Business Ontology Model that helps organizations think strategically and adapt to change swiftly.","author":[{"family":"Yakan","given":"Ammar C"},{"family":"Rashid","given":"Ameer Sardar K"}],"citation-key":"yakan_rashid__2016__strategic","issue":"1","issued":{"date-parts":[[2016]]},"keyword":"collection::strategy::ontology","language":"en","page":"20","source":"Zotero","title":"Strategic Business Ontology Model","type":"article-journal","volume":"12"}
]
